hpmicro/hpm_sdk/soc/HPM6E00/HPM6E84/HPM6E84_svd.xml
        <register>
          <name>CENTRAL_CSR_VERSION</name>
          <description>version register</description>
          <addressOffset>0x2000</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF00FF</resetMask>
          <fields>
            <field>
              <name>VER_HI</name>
              <description>Major Version number of TSN-SW core.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VER_LO</name>
              <description>Minor Version number of TSN-SW core.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VER_REV</name>
              <description>Reversion number of TSN-SW core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CENTRAL_CSR_PARAM</name>
          <description>Parameter Register</description>
          <addressOffset>0x2004</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007FFFF</resetMask>
          <fields>
            <field>
              <name>INCL_QCI</name>
              <description>Shows if QCI module is present.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INCL_CB0</name>
              <description>Shows if IP is configured with “lightweight” 802.1CB at CPU-Port.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TESTMODE</name>
              <description>Shows if IP is configured in TESTMODE.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TYPE</name>
              <description>Specify type of switch core</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPORTS</name>
              <description>Number of TSN ports without counting internal CPU port. For TSN-SE, it returns always 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CENTRAL_CSR_CONFIG</name>
          <description>Configuration Register</description>
          <addressOffset>0x2008</addressOffset>
          <size>32</size>
          <resetValue>0x00100000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>MSEC_CYCLES</name>
              <description>Number of SYS_CLK cycles during 1 ms. It is required to calculate a correct time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CENTRAL_CSR_CB_PARAM</name>
          <description>CB Parameter Register</description>
          <addressOffset>0x200c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>SID_D</name>
              <description>Number of 802.1CB Stream Identification entries. 2^SID_D entries</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRER_D</name>
              <description>Number of 802.1CB Recovery Function entries. 2^FRER_D entries.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CENTRAL_CSR_QCI_CTRL_PARAM</name>
          <description>QCI Control Parameter Register</description>
          <addressOffset>0x2010</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>QCI_GTD</name>
              <description>(Log) gate table depth. 2**GTD entries.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>QCI_FMD</name>
              <description>(Log) flow meter depth. 2**FMD entries.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>QCI_FTD</name>
              <description>(Log) filter table depth. 2**FTD entries.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CENTRAL_QCI_HWCFG</name>
          <description>PSPF General CTRAL</description>
          <addressOffset>0x2104</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>FMD</name>
              <description>FMD – parameter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GTD</name>
              <description>GTD – parameter</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FTD</name>
              <description>FTD – parameter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CENTRAL_QCI_FILTERSEL</name>
          <description>Filter select index</description>
          <addressOffset>0x2110</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>INDEX</name>
              <description>Filter select index
Any written value larger than the maximum index
(2**FTD-1) will result in a read-back value of &lt;0&gt;.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CENTRAL_QCI_METERSEL</name>
          <description>Flowmeter select index</description>
          <addressOffset>0x2114</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>INDEX</name>
              <description>Flowmeter select index
Any written value larger than the maximum index
(2**FMD-1) will result in a read-back value of &lt;0&gt;.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CENTRAL_QCI_GATESEL</name>
          <description>Gate select index</description>
          <addressOffset>0x2118</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>INDEX</name>
              <description>Gate select index
Any written value larger than the maximum index
(2**GTD-1) will result in a read-back value of &lt;0&gt;.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CENTRAL_QCI_FCTRL</name>
          <description>FILTER SETTING</description>
          <addressOffset>0x2120</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENBLK</name>
              <description>Enable blocking of oversized frames
(802.1Qci – 8.6.5.1.1 (g))</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENFSZ</name>
              <description>0: No frame size check
1: Frame size checking, size defined by FSIZE.MXSZ
(802.1Qci – 8.6.5.1.1 (e.1))</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENFID</name>
              <description>0: No Flow Meter
1: Enable Flow Metering
(802.1Qci – 8.6.5.1.1 (e.2))</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENSID</name>
              <description>0: Filter match any SID value
1: Filter match SID value
(802.1Qci – 8.6.5.1.1 (b))</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENPCP</name>
              <description>0: Filter match any PCP value
1: Filter match PCP value
(802.1Qci – 8.6.5.1.1 (c))</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCP</name>
              <description>Filter priority code point, if enabled by ENPCP</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMD</name>
              <description>Associated Flow Meter – if enabled by ENFID</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GID</name>
              <description>Associated Gate</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SID</name>
              <description>Filter Stream ID – if enabled by ENSID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CENTRAL_QCI_FSIZE</name>
          <description>No description available</description>
          <addressOffset>0x2124</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x8000FFFF</resetMask>
          <fields>
            <field>
              <name>BLK</name>
              <description>Stream blocked due to oversize frame.
Write &lt;1&gt; to clear.
(802.1Qci – 8.6.5.1.1 (h))</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MXSZ</name>
              <description>Maximum-SDU size in octets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>CENTRAL_QCI_CNT0,CENTRAL_QCI_CNT1,CENTRAL_QCI_CNT2,CENTRAL_QCI_CNT3,CENTRAL_QCI_CNT4,CENTRAL_QCI_CNT5</dimIndex>
          <name>QCI_CNT[%s]</name>
          <description>no description available</description>
          <addressOffset>0x2140</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Filter counter (see 802.1Qci 8.6.5.1.1 f)
CNT0: Frames that matched filter
CNT1: Frames that passed gate
CNT2: Frames that did not pass gate
CNT3: Frames that passed Maximum-SDU size check
CNT4: Frames that did not pass size check
CNT5: Frames discarded by Flow Meter operation
Counters starting at value &lt;0&gt; after reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CENTRAL_QCI_MCTRL</name>
          <description>Flow meter settings</description>
          <addressOffset>0x2160</addressOffset>
          <size>32</size>
          <resetValue>0x80000000</resetValue>
          <resetMask>0x8000001F</resetMask>
          <fields>
            <field>
              <name>RESET</name>
              <description>Flow Meter reset – self-resetting to &lt;0&gt;</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MAFR</name>
              <description>MarkAllFramesRed – cleared by RESET
(802.1Qci – 8.6.5.1.3 (j))</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAFREN</name>
              <description>MarkAllFramesRedEnable
(802.1Qci – 8.6.5.1.3 (i))</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DOY</name>
              <description>DropOnYellow
(802.1Qci – 8.6.5.1.3 (h))</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CM</name>
              <description>Color mode – functionally unused
(802.1Qci – 8.6.5.1.3 (g))</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CF</name>
              <description>Coupling flag
(802.1Qci – 8.6.5.1.3 (f))</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CENTRAL_QCI_CIR</name>
          <description>No description available</description>
          <addressOffset>0x2170</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>CIR</name>
              <description>Committed information rate – see Chapter 7.5.2.4.
(802.1Qci – 8.6.5.1.3 (b))</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CENTRAL_QCI_CBS</name>
          <description>No description available</description>
          <addressOffset>0x2174</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CBS</name>
              <description>Committed burst size, in bits (not octets!)
(802.1Qci – 8.6.5.1.3 (c))</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CENTRAL_QCI_EIR</name>
          <description>No description available</description>
          <addressOffset>0x2178</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>EIR</name>
              <description>Excess information rate – see Chapter 7.5.2.4.
(802.1Qci – 8.6.5.1.3 (d))</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CENTRAL_QCI_EBS</name>
          <description>No description available</description>
          <addressOffset>0x217c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EBS</name>
              <description>Excess burst size, in bits (not octets)
(802.1Qci – 8.6.5.1.3 (e))</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CENTRAL_QCI_GCTRL</name>
          <description>Gate settings</description>
          <addressOffset>0x2180</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>IPV</name>
              <description>Administrative internal priority value specification
(802.1Qci – 8.6.5.1.2 (c))</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STATE</name>
              <description>Administrative stream gate state
(802.1Qci – 8.6.5.1.2 (b))</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CDOEE</name>
              <description>Gate – ClosedDueToOctetsExceededEnable
(802.1Qci – 8.6.5.1.2 (f))</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CDIRE</name>
              <description>Gate – ClosedDueToInvalidRxEnable
(802.1Qci – 8.6.5.1.2 (d))</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CFGCH</name>
              <description>Gate – change config (self-resetting to &lt;0&gt;)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Gate control – enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CENTRAL_QCI_GSTATUS</name>
          <description>No description available</description>
          <addressOffset>0x2184</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>IPV</name>
              <description>Operational internal priority value specification
(802.1Qci – 8.6.5.1.2 (c))</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATE</name>
              <description>Operational stream gate state
(802.1Qci – 8.6.5.1.2 (b))</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CDOE</name>
              <description>Gate – ClosedDueToOctetsExceeded. Write &lt;1&gt; to
clear.
(802.1Qci – 8.6.5.1.2 (g))</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CDIR</name>
              <description>Gate – ClosedDueToInvalidRx. Write &lt;1&gt; to clear.
(802.1Qci – 8.6.5.1.2 (e))</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CFGP</name>
              <description>Configuration change pending</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFGERR</name>
              <description>Configuration change error. Write &lt;1&gt; to clear.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CENTRAL_QCI_GLISTINDEX</name>
          <description>No description available</description>
          <addressOffset>0x2188</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>IDX</name>
              <description>Admin list pointer, select entry 0 – 15.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
