hpmicro/hpm_sdk/soc/HPM6E00/HPM6E84/HPM6E84_svd.xml
        <register>
          <name>S2MM_LENGTH</name>
          <description>s2mm axi length</description>
          <addressOffset>0x40a8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>LENGTH</name>
              <description>transfer request length in bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>S2MM_CTRL</name>
          <description>s2mm command control</description>
          <addressOffset>0x40ac</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x8000000F</resetMask>
          <fields>
            <field>
              <name>GO</name>
              <description>commit buffered descriptor to command queue</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ID</name>
              <description>command id</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>S2MM_RESP</name>
          <description>s2mm response buffer</description>
          <addressOffset>0x40b0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7F00FFFF</resetMask>
          <fields>
            <field>
              <name>LAST</name>
              <description>axi-stream with last</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DECERR</name>
              <description>decode error</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLVERR</name>
              <description>slave error</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID</name>
              <description>command ID feedback</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LENGTH</name>
              <description>received packet size when terminated by TLAST</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTP_EVT_TS_CTL</name>
          <description>timestamp control</description>
          <addressOffset>0x6000</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1F000010</resetMask>
          <fields>
            <field>
              <name>ATSEN</name>
              <description>auxiliay snapshot enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATSFC</name>
              <description>auxiliary snapshot fifo clear</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TSTIG</name>
              <description>timestamp interrupt trigger enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTP_EVT_PPS_TOD_SEC</name>
          <description>pps tod seconds</description>
          <addressOffset>0x6008</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PPS_TOD_SEC</name>
              <description>pps tod seconds</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTP_EVT_PPS_TOD_NS</name>
          <description>pps tod sun seconds</description>
          <addressOffset>0x600c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>PPS_TOD_NS</name>
              <description>pps tod sub seconds</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTP_EVT_SCP_SEC0</name>
          <description>target time seconds</description>
          <addressOffset>0x601c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCP_SEC</name>
              <description>target time seconds</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTP_EVT_SCP_NS0</name>
          <description>target time sub seconds</description>
          <addressOffset>0x6020</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCP_NS</name>
              <description>target time sub seconds</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTP_EVT_TMR_STS</name>
          <description>timer status</description>
          <addressOffset>0x6028</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3F0F07FE</resetMask>
          <fields>
            <field>
              <name>RD_CNT</name>
              <description>fifo valid count</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ATSSTM</name>
              <description>auxiliary fifo full error</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ATPORT</name>
              <description>auxiliary port</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PPS_TOD_INTR</name>
              <description>pps tod intrrupt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TARGET_TIME3_CFG_ERR</name>
              <description>target time3 configure error</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TARGET_TIME3_REACH_INTR</name>
              <description>target time3 reached</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TARGET_TIME2_CFG_ERR</name>
              <description>target time2 configure error</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TARGET_TIME2_REACH_INTR</name>
              <description>target time2 reached</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TARGET_TIME1_CFG_ERR</name>
              <description>target time1 configure error</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TARGET_TIME1_REACH_INTR</name>
              <description>target time1 reached</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TARGET_TIME0_CFG_ERR</name>
              <description>target time0 configure error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PTP_FIFO_WR_INTR</name>
              <description>auxiliary timestamp trigger snapshot</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TARGET_TIME0_REACH_INTR</name>
              <description>target time0 reached</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTP_EVT_PPS_CMD</name>
          <description>pps command control</description>
          <addressOffset>0x602c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x6767677F</resetMask>
          <fields>
            <field>
              <name>PPS_MODE3</name>
              <description>Target Time Register Mode for PPS3 Output</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPS_CMD3</name>
              <description>pps3 command</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPS_MODE2</name>
              <description>Target Time Register Mode for PPS2 Output</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPS_CMD2</name>
              <description>pps2 command</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPS_MODE1</name>
              <description>Target Time Register Mode for PPS1 Output</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPS_CMD1</name>
              <description>pps1 command</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPS_MODE0</name>
              <description>Target Time Register Mode for PPS0 Output</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPS_EN0</name>
              <description>flexible PPS0 output mode enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPS_CMD0</name>
              <description>pps0 command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTP_EVT_ATSLO</name>
          <description>auxiliray read data sub seconds</description>
          <addressOffset>0x6030</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFFFFFF</resetMask>
          <fields>
            <field>
              <name>STSLO</name>
              <description>auxiliary fifo read sub seconds info</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTP_EVT_ATSHI</name>
          <description>auxiliray read data seconds</description>
          <addressOffset>0x6034</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STSHI</name>
              <description>auxiliary fifo read  seconds info</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTP_EVT_PPS0_INTERVAL</name>
          <description>pps0 interval configure</description>
          <addressOffset>0x6060</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PPSINT</name>
              <description>PPS0 output signal interval</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTP_EVT_PPS0_WIDTH</name>
          <description>pps0 width configure</description>
          <addressOffset>0x6064</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PPS_WIDTH</name>
              <description>pps0 output signal width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTP_EVT_SCP_SEC1</name>
          <description>target time seconds</description>
          <addressOffset>0x6080</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCP_SEC</name>
              <description>target time seconds</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTP_EVT_SCP_NS1</name>
          <description>target time sub seconds</description>
          <addressOffset>0x6084</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCP_NS</name>
              <description>target time sub seconds</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTP_EVT_PPS1_INTERVAL</name>
          <description>pps1 interval configure</description>
          <addressOffset>0x6088</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PPSINT</name>
              <description>PPS1 output signal interval</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTP_EVT_PPS1_WIDTH</name>
          <description>pps1 width configure</description>
          <addressOffset>0x608c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PPS_WIDTH</name>
              <description>pps1 output signal width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTP_EVT_SCP_SEC2</name>
          <description>target time seconds</description>
          <addressOffset>0x60a0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCP_SEC</name>
              <description>target time seconds</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTP_EVT_SCP_NS2</name>
          <description>target time sub seconds</description>
          <addressOffset>0x60a4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCP_NS</name>
              <description>target time sub seconds</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTP_EVT_PPS2_INTERVAL</name>
          <description>pps2 interval configure</description>
          <addressOffset>0x60a8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PPSINT</name>
              <description>PPS2 output signal interval</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTP_EVT_PPS2_WIDTH</name>
          <description>pps2 width configure</description>
          <addressOffset>0x60ac</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PPS_WIDTH</name>
              <description>pps2 output signal width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTP_EVT_SCP_SEC3</name>
          <description>target time seconds</description>
          <addressOffset>0x60c0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCP_SEC</name>
              <description>target time seconds</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTP_EVT_SCP_NS3</name>
          <description>target time sub seconds</description>
          <addressOffset>0x60c4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCP_NS</name>
              <description>target time sub seconds</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTP_EVT_PPS3_INTERVAL</name>
          <description>pps3 interval configure</description>
          <addressOffset>0x60c8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PPSINT</name>
              <description>PPS3 output signal interval</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTP_EVT_PPS3_WIDTH</name>
          <description>pps3 width configure</description>
          <addressOffset>0x60cc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PPS_WIDTH</name>
              <description>pps3 output signal width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
