hpmicro/hpm_sdk/soc/HPM6E00/HPM6E84/HPM6E84_svd.xml
        <register>
          <name>CPU_PORT_MONITOR_RX_COUNTER_RX_VLAN</name>
          <description>No description available</description>
          <addressOffset>0x18080</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_VLAN</name>
              <description>Number of VLAN tagged frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_MONITOR_RX_COUNTER_RX_DROP_OVFL</name>
          <description>No description available</description>
          <addressOffset>0x18088</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_DROP_OVFL</name>
              <description>Dropped frames by ingress overflow.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_MONITOR_RX_COUNTER_RX_DROP_LU</name>
          <description>No description available</description>
          <addressOffset>0x18090</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_DROP_LU</name>
              <description>Dropped frames by LookUp decision.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_MONITOR_RX_COUNTER_RX_DROP_ERR</name>
          <description>No description available</description>
          <addressOffset>0x18098</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_DROP_ERR</name>
              <description>Dropped frames with error by ingress. Possible in S&amp;F mode or when frame is queued in ingress.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_MONITOR_RX_COUNTER_RX_DROP_VLAN</name>
          <description>No description available</description>
          <addressOffset>0x180a0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_DROP_VLAN</name>
              <description>Dropped frames by incompatible VLAN.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_MONITOR_RX_COUNTER_RX_FPE_FGOOD</name>
          <description>No description available</description>
          <addressOffset>0x180a8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_FPE_FGOOD</name>
              <description>Number of preemptable frames. Subset of RX_FGOOD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>3</dim>
          <dimIncrement>0x20000</dimIncrement>
          <dimIndex>port1,port2,port3</dimIndex>
          <name>TSNPORT[%s]</name>
          <description>no description available</description>
          <addressOffset>0x20000</addressOffset>
          <cluster>
            <dim>2</dim>
            <dimIncrement>0x200</dimIncrement>
            <dimIndex>em1,pm1</dimIndex>
            <name>MAC[%s]</name>
            <description>no description available</description>
            <addressOffset>0x0</addressOffset>
            <register>
              <name>MAC_VER</name>
              <description>No description available</description>
              <addressOffset>0x0</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>VER_H</name>
                  <description>Major version number (higher part of the version)</description>
                  <bitOffset>16</bitOffset>
                  <bitWidth>16</bitWidth>
                  <access>read-only</access>
                </field>
                <field>
                  <name>VER_L</name>
                  <description>Minor version number (lower part of the version)</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>16</bitWidth>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>MAC_MACADDR_L</name>
              <description>No description available</description>
              <addressOffset>0x4</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>MACADDR</name>
                  <description>MAC address
Lower bits of MAC address (31:0).
MACADDR only be modified if TX_EN=0 and RX_EN=0.</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>MAC_MACADDR_H</name>
              <description>No description available</description>
              <addressOffset>0x8</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0x0001FFFF</resetMask>
              <fields>
                <field>
                  <name>PROMISC</name>
                  <description>0 – disabled
1 – enabled
If promiscuous mode is enabled, then reception of all frames independent from the
Ethernet destination address is enabled.
PROMISC can be changed at any time.</description>
                  <bitOffset>16</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>MACADDR</name>
                  <description>MAC address (see Chapter 4.1)
Upper bits of MAC address (47:32).
MACADDR can only be modified if TX_EN=0 and RX_EN=0.</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>16</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>MAC_MAC_CTRL</name>
              <description>No description available</description>
              <addressOffset>0xc</addressOffset>
              <size>32</size>
              <resetValue>0x00191930</resetValue>
              <resetMask>0x1F193F7F</resetMask>
              <fields>
                <field>
                  <name>FSTIM</name>
                  <description>Fault Stimulation
See Chapter 11.3, Table 11-1 for details.
FSTIM is write-locked if CSA=1.</description>
                  <bitOffset>24</bitOffset>
                  <bitWidth>5</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>RCA</name>
                  <description>&lt;ref_clk&gt; active
0 – not active
1 – active
See chapter 11.2.3 for details.</description>
                  <bitOffset>20</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-only</access>
                </field>
                <field>
                  <name>MCA</name>
                  <description>&lt;mii_clk&gt; active
0 – not active
1 – active
See chapter 11.2.3 for details.</description>
                  <bitOffset>19</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-only</access>
                </field>
                <field>
                  <name>SEN</name>
                  <description>Safety Enable
0 – disabled
1 – enabled
If enabled, then two instances of the logic core of LLEMAC-1G are compared at
runtime to each other.
SEN can only be changed if RX_EN and TX_EN can be read as 0. Deactivation delays
of RX_EN and TX_EN have to be considered. It is possible to change SEN together
with the activation of RX_EN and TX_EN.</description>
                  <bitOffset>16</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>CSA</name>
                  <description>Clock switching active (&lt;tx_clk&gt;)
0 – not active
1 – active
Switching of &lt;tx_clk&gt; is commanded if CLKSEL or FSTIM (see Table 11-1) are
written. Clock switching takes a few clock cycles and this is signaled with CSA=1.
When CSA=1 then CLKSEL and FSTIM are write-locked and cannot be changed.</description>
                  <bitOffset>13</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RCE</name>
                  <description>&lt;ref_clk&gt; enable
0 – disabled
1 – enabled
RCE can only be modified if CLKSEL=111. See Chapter 7.3.3 for further details.</description>
                  <bitOffset>12</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>MCE</name>
                  <description>&lt;mii_clk&gt; enable
0 – disabled
1 – enabled
MCE can only be modified if CLKSEL=111. See Chapter 7.3.3 for further details.</description>
                  <bitOffset>11</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>CLKSEL</name>
                  <description>TX path clock selector
000 – &lt;mii_clk&gt;
001 – &lt;ref_clk&gt; (recommended setting for this selection)
010 – &lt;ref_clk&gt; divided by 5
011 – &lt;ref_clk&gt; divided by 10
100 – &lt;ref_clk&gt; divided by 50
111 – &lt;ref_clk&gt; and enables modification of RCE and MCE
others – &lt;ref_clk&gt;
See Chapter 7 for further details.
CLKSEL is write-locked if CSA=1.</description>
                  <bitOffset>8</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>PHYSEL</name>
                  <description>Selection of the PHY
01 – GMII, fixed to 1</description>
                  <bitOffset>5</bitOffset>
                  <bitWidth>2</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>GMIIMODE</name>
                  <description>GMII mode / Ethernet speed selection (See Chapter 4.5.)
0 – MII: 10Mbit/s or 100Mbit/s
1 – GMII: 1GBit/s
GMIIMODE can only be changed if RX_EN=0 and TX_EN=0. Deactivation delays of
RX_EN and TX_EN have to be considered. GMIIMODE can only be changed, if these
register bits can be read as 0. It is possible to change GMIIMODE together with the
activation of RX_EN and TX_EN.
GMIIMODE drives the outputs &lt;tx_gmiimode&gt; and &lt;rx_gmiimode&gt;.</description>
                  <bitOffset>4</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>JUMBO</name>
                  <description>Jumbo frame support
0 – jumbo frames not supported
1 – jumbo frame supported (not recommended)
Jumbo frames are non-standard Ethernet frames with a size bigger than envelope
frames (which contain 1982 payload bytes). If jumbo frames are not supported, then
LLEMAC-1G generates the appropriate error signals (&lt;tx_gmii_er&gt; for the TX path
and &lt;rx_avst_err&gt; for the RX path).
Although jumbo frames typically contain up to 9000 bytes, the LLEMAC-1G can handle
an infinite frame size. The problem of jumbo frames is the necessary storage space in
transmission and reception buffers. LLEMAC-1G does not include storage buffers.
JUMBO can be activated or deactivated at any time. The new setting becomes valid
immediately after clock domain crossing.</description>
                  <bitOffset>3</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>TX_EN</name>
                  <description>TX path enable
0 – transmission disabled - Avalon-ST READY for the TX path will be set to 0.
1 – transmission enabled
TX_EN can be activated or deactivated at any time. Deactivation may take some time.
If during deactivation there is a frame in transmission, then this frame will be
completed fist. Afterwards bit TX_EN can be read as 0.
After the transmission is disabled there may be pending frames left, waiting at the TX
stream interface.</description>
                  <bitOffset>2</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>RX_EN</name>
                  <description>RX path enable
0 – reception disabled – no frames fed to Avalon-ST RX path
1 – reception enabled
RX_EN can be activated or deactivated at any time. Deactivation may take some time.
If during deactivation there is a frame in reception, then this frame will be completed
first. Afterwards bit RX_EN can be read as 0.</description>
                  <bitOffset>1</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>RESSTAT</name>
                  <description>Software reset of the statistic counters (see Table 3-8)
0 – no reset
1 – reset active
RESSTAT will be automatically set to 0 after the counters have been reset</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>MAC_TX_FRAMES</name>
              <description>No description available</description>
              <addressOffset>0x10</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>TX_FRAMES</name>
                  <description>Number of successfully transmitted frames.</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>MAC_RX_FRAMES</name>
              <description>No description available</description>
              <addressOffset>0x14</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>RX_FRAMES</name>
                  <description>Number of successfully received frames.</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>MAC_TX_OCTETS</name>
              <description>No description available</description>
              <addressOffset>0x18</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>TX_OCTETS</name>
                  <description>Number of successfully transmitted payload and padding octets.</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>MAC_RX_OCTETS</name>
              <description>No description available</description>
              <addressOffset>0x1c</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>RX_OCTETS</name>
                  <description>Number of successfully received payload and padding octets.</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>MAC_MDIO_CFG</name>
              <description>No description available</description>
              <addressOffset>0x20</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0x000081FF</resetMask>
              <fields>
                <field>
                  <name>NPRE</name>
                  <description>No Preamble
With NPRE=1 the preamble generation is suppressed and frames are initiated with
Start of Frame pattern directly. Suitable in case that all connected PHYs accept
management frames without a preamble pattern. Recommended to be used if only
one PHY is connected.</description>
                  <bitOffset>15</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>ENABLE</name>
                  <description>Enable the MDIO controller. If the controller is enabled then MDC will be toggled.
ENABLE can only be read as 1 if a valid MDC_CLKDIV value is set.</description>
                  <bitOffset>8</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>MDC_CLKDIV</name>
                  <description>Clock Divider to configure MDC clock frequency. Refer to 10.1 Clock Divider for more
details.</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>8</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>MAC_MDIO_CTRL</name>
              <description>No description available</description>
              <addressOffset>0x24</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xDF1F0101</resetMask>
              <fields>
                <field>
                  <name>OP</name>
                  <description>Opcode to determine transfer type
01 – Write Access
10 – Read Access</description>
                  <bitOffset>30</bitOffset>
                  <bitWidth>2</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>PHYAD</name>
                  <description>Management Frame PHY Address.</description>
                  <bitOffset>24</bitOffset>
                  <bitWidth>5</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>REGAD</name>
                  <description>Management Frame Register Address.</description>
                  <bitOffset>16</bitOffset>
                  <bitWidth>5</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>INIT</name>
                  <description>INIT=1 results in a MDIO write/read transfer if READY=1. If READY=0 while a
transfer is already pending or if ENABLE=0 then settings INIT=1 has no effect and
the current transaction is withdrawn.</description>
                  <bitOffset>8</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>READY</name>
                  <description>READY=1 indicates a finished transfer and also shows that the controller is ready for a
new transfer. READY=1 is only possible if ENABLE=1.
If READY=1 is signaled after a read transfer, then RD_DATA is valid until a new
transfer is started.</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>MAC_MDIO_RD_DATA</name>
              <description>No description available</description>
              <addressOffset>0x28</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0x0000FFFF</resetMask>
              <fields>
                <field>
                  <name>RD_DATA</name>
                  <description>Read Data is available if READY=1 after a transfer has been started. RD_DATA represents the content of the management data field of the read transfer.</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>16</bitWidth>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>MAC_MDIO_WR_DATA</name>
              <description>No description available</description>
              <addressOffset>0x2c</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0x0000FFFF</resetMask>
              <fields>
                <field>
                  <name>WR_DATA</name>
                  <description>Data is used for the management data field after a write transfer has been started</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>16</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
